nine_cats/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "name" = $2, "sex" = $3, "description" = $4, "updated_at" = $5 WHERE "cats"."id" = $6  [["color", "white"], ["name", "TWICE"], ["sex", "F"], ["description", "I can't stop me"], ["updated_at", "2021-02-12 11:15:14.714327"], ["id", 8]]
---
def update
    @cat = Cat.find_by(id: params[:id])
    if @cat.update(cat_params)